# Data Collection

In [1]:
!pip install -U scikit-learn

Requirement already satisfied: scikit-learn in d:\anaconda\lib\site-packages (1.5.0)
Requirement already satisfied: numpy>=1.19.5 in d:\anaconda\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in d:\anaconda\lib\site-packages (from scikit-learn) (1.11.4)
Requirement already satisfied: joblib>=1.2.0 in d:\anaconda\lib\site-packages (from scikit-learn) (1.2.0)
Requirement already satisfied: threadpoolctl>=3.1.0 in d:\anaconda\lib\site-packages (from scikit-learn) (3.5.0)

In [2]:
!pip install sqlalchemy==1.4.46

Collecting sqlalchemy==1.4.46
  Using cached SQLAlchemy-1.4.46-cp311-cp311-win_amd64.whl.metadata (10 kB)
Requirement already satisfied: greenlet!=0.4.17 in d:\anaconda\lib\site-packages (from sqlalchemy==1.4.46) (3.0.1)
Using cached SQLAlchemy-1.4.46-cp311-cp311-win_amd64.whl (1.6 MB)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.31
    Uninstalling SQLAlchemy-2.0.31:
      Successfully uninstalled SQLAlchemy-2.0.31
Successfully installed sqlalchemy-1.4.46

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
ipython-sql 0.5.0 requires sqlalchemy>=2.0, but you have sqlalchemy 1.4.46 which is incompatible.

In [3]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in d:\anaconda\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in d:\anaconda\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in d:\anaconda\lib\site-packages (from ipython-sql) (8.20.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Using cached SQLAlchemy-2.0.31-cp311-cp311-win_amd64.whl.metadata (9.9 kB)
Requirement already satisfied: sqlparse in d:\anaconda\lib\site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in d:\anaconda\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in d:\anaconda\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in d:\anaconda\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in d:\anaconda\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: colorama in d:\anaconda\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in d:\anaconda\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in d:\anaconda\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in d:\anaconda\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in d:\anaconda\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in d:\anaconda\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Using cached SQLAlchemy-2.0.31-cp311-cp311-win_amd64.whl (2.1 MB)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.46
    Uninstalling SQLAlchemy-1.4.46:
      Successfully uninstalled SQLAlchemy-1.4.46
Successfully installed sqlalchemy-2.0.31

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler,PolynomialFeatures
from sklearn.linear_model import LinearRegression
%matplotlib inline

In [5]:
%load_ext sql

In [6]:
import csv, sqlite3
import requests
import datetime

In [7]:
# print all collumns of a dataframe
pd.set_option('display.max_columns', None)
# print all of the data in a feature
pd.set_option('display.max_colwidth', None)

In [8]:
# read dataset and display the first 5 rows
df = pd.read_csv('social_media_data.csv')
df.head()

         date   platform post_type   likes  shares  comments   views
0  2023-05-24    Twitter     image   868.0   238.0     352.0  8836.0
1  2023-02-23    Twitter     image   944.0   610.0     146.0  5554.0
2  2023-03-18  Instagram     image  1067.0   858.0     365.0  4018.0
3  2023-06-12    Twitter      text   780.0   427.0     100.0  6999.0
4  2023-02-03  Instagram      text   836.0   893.0     443.0  5802.0

# Data Cleaning

In [9]:
df.dtypes

date          object
platform      object
post_type     object
likes        float64
shares       float64
comments     float64
views        float64
dtype: object

In [10]:
#calculate missing values
df.isnull().sum()/len(df)*100

date         0.0
platform     0.0
post_type    0.0
likes        0.4
shares       0.4
comments     0.4
views        0.5
dtype: float64

In [11]:
#printing the number of missing values based on what was found 
print("number of NaN values for the column likes :", df['likes'].isnull().sum())
print("number of NaN values for the column shares :", df['shares'].isnull().sum())
print("number of NaN values for the column comments :", df['comments'].isnull().sum())
print("number of NaN values for the column views :", df['views'].isnull().sum())

number of NaN values for the column likes : 8
number of NaN values for the column shares : 8
number of NaN values for the column comments : 8
number of NaN values for the column views : 10

In [12]:
#cleaning up the data by filling the missing values with the mean of the column
likes_mean = df['likes'].mean()
df['likes'].replace(np.nan,likes_mean,inplace=True)

shares_mean = df['shares'].mean()
df['shares'].replace(np.nan,shares_mean,inplace=True)

comments_mean = df['comments'].mean()
df['comments'].replace(np.nan,comments_mean,inplace=True)

views_mean = df['views'].mean()
df['views'].replace(np.nan,views_mean,inplace=True)

In [13]:
#checking for missing values
print("number of NaN values for the column likes :", df['likes'].isnull().sum())
print("number of NaN values for the column shares :", df['shares'].isnull().sum())
print("number of NaN values for the column comments :", df['comments'].isnull().sum())
print("number of NaN values for the column views :", df['views'].isnull().sum())

number of NaN values for the column likes : 0
number of NaN values for the column shares : 0
number of NaN values for the column comments : 0
number of NaN values for the column views : 0

In [14]:
df['platform'].value_counts().to_frame()

                     count
platform
Twitter                685
Instagram              678
Facebook               631
NonExistingPlatform      6

##### Since there's a NonExisting Platform, I delete it as it is of no use and it will hinder the data

In [15]:
df =  df[df['platform']!= 'NonExistingPlatform']

In [16]:
df['platform'].value_counts().to_frame()

           count
platform
Twitter      685
Instagram    678
Facebook     631

In [17]:
#converting the columns to their appropriate data types
df['likes'] = df['likes'].astype('int64')
df['shares'] = df['shares'].astype('int64')
df['comments'] = df['comments'].astype('int64')
df['views'] = df['views'].astype('int64')

df['date'] = df['date'].astype('datetime64[ns]')

In [18]:
df.dtypes

date         datetime64[ns]
platform             object
post_type            object
likes                 int64
shares                int64
comments              int64
views                 int64
dtype: object

# Data Analysis

In [19]:
con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [20]:
%sql sqlite:///my_data1.db

In [21]:
df.to_sql("SOCIALDATA", con, if_exists='replace', index=False,method="multi")

1994

In [22]:
%sql create table SOCIALDATATBL as select * from SOCIALDATA where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SOCIALDATATBL already exists
[SQL: create table SOCIALDATATBL as select * from SOCIALDATA where Date is not null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Q1) What was the total number of likes, shares, comments, and views (for videos) over the year?

In [23]:
%sql select sum(likes), sum(shares), sum(comments), sum(views) from SOCIALDATATBL where post_type = 'video'

 * sqlite:///my_data1.db
Done.

[(815438, 311331, 194617, 4485335)]

### Q2) Which platform had the highest engagement? (engagement = likes + shares + comments)

In [24]:
#adding likes, shares and comments and name them as total_engagement and then sort the platforms in a descending order
%sql select platform, sum(likes+ shares+ comments) as total_engagement  from SOCIALDATATBL group by platform order by total_engagement desc

 * sqlite:///my_data1.db
Done.

[('Instagram', 1426670), ('Twitter', 1413395), ('Facebook', 1334070)]

### Q3) What was the average number of likes, shares, comments, and views per post on each platform?

In [25]:
%sql select platform, avg(likes) as avg_likes, avg(shares) as avg_shares, avg(comments) as avg_comments, avg(views) as avg_views from SOCIALDATATBL group by platform

 * sqlite:///my_data1.db
Done.

[('Facebook', 1289.9746434231379, 513.0903328050713, 311.1505546751189, 6984.123613312203),
 ('Instagram', 1305.787610619469, 497.3702064896755, 301.07522123893807, 6906.141592920354),
 ('Twitter', 1275.014598540146, 482.4802919708029, 305.85547445255474, 7013.051094890511)]

### Q4) What was the total number of each type of post (video, image, text) on each platform?

In [26]:
%sql select platform, sum(CASE WHEN post_type = 'video' then 1 else 0 end) AS video, sum(case when post_type = 'image' then 1 else 0 end) AS image, sum(case when post_type = 'text' then 1 else 0 end) AS text from SOCIALDATATBL group by platform

 * sqlite:///my_data1.db
Done.

[('Facebook', 209, 218, 204),
 ('Instagram', 208, 267, 203),
 ('Twitter', 217, 249, 219)]

### Q5) Which type of post had the highest average engagement?

In [32]:
%sql select post_type, likes, shares, comments, avg(COALESCE(likes, 0)+COALESCE(shares,0)+COALESCE(comments,0)) as avg_engagement from SOCIALDATATBL group by post_type order by avg_engagement desc

 * sqlite:///my_data1.db
Done.

[('text', 780, 427, 100, 2131.4984025559106),
 ('video', 515, 216, 380, 2084.205047318612),
 ('image', 868, 238, 352, 2068.707084468665)]

### Q6) What was the total engagement in each quarter of the year?

In [51]:
%sql select sum(likes+shares+comments) as Q1_total_engagement from socialdatatbl where date between '2022-10-13' and '2023-01-13'

 * sqlite:///my_data1.db
Done.

[(1071642,)]

In [52]:
%sql select sum(likes+shares+comments) as Q2_total_engagement from socialdatatbl where date between '2023-01-14' and '2023-04-14'

 * sqlite:///my_data1.db
Done.

[(1042833,)]

In [53]:
%sql select sum(likes+shares+comments) as Q3_total_engagement from socialdatatbl where date between '2023-04-15' and '2023-07-15'

 * sqlite:///my_data1.db
Done.

[(991936,)]

In [54]:
%sql select sum(likes+shares+comments) as Q4_total_engagement from socialdatatbl where date between '2023-07-15' and '2023-10-15'

 * sqlite:///my_data1.db
Done.

[(1042498,)]